src/Reports/АнализРаспределенияЗатрат/АнализРаспределенияЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>АнализРаспределенияЗатрат</name>
  <comment>(Упр)</comment>
  <attributes>
    <name>УниверсальныйОтчет</name>
    <type>
      <types>ReportObject.УниверсальныйОтчет</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Report>

src/AccumulationRegisters/ЗатратыНаВыпускПродукции/ЗатратыНаВыпускПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗатратыНаВыпускПродукции</name>
  <comment>(Упр)</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийЗатратыНаВыпускПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗатратыВстречногоВыпуска</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КосвенныеЗатраты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаПродукции</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияПродукции</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.СпецификацииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументВыпуска</name>
    <type>
      <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
      <types>DocumentRef.ОтчетПроизводстваЗаСмену</types>
      <types>DocumentRef.ПоступлениеТоваровИзПереработки</types>
      <types>DocumentRef.КомплектацияНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Затрата</name>
    <type>
      <types>EnumRef.ХарактерЗатрат</types>
      <types>CatalogRef.СпособыРаспределенияЗатратНаВыпуск</types>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаЗатраты</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияЗатраты</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатурнаяГруппаНЗП</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказНЗП</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодразделениеНЗП</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/ВыпускПродукции/ВыпускПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВыпускПродукции</name>
  <comment>(Упр)</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоДоделка</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийВыпускПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеПолучатель</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПолучатель</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяЗатратПолучатель</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппаПолучатель</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяЗатратПоВозврату</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродукцияПолучатель</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаПродукцииПолучатель</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияПродукцииПолучатель</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПартии</name>
    <type>
      <types>EnumRef.СтатусыПартийТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантВыпускаПродукции</name>
    <type>
      <types>EnumRef.ВариантыВыпускаПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектСтроительства</name>
    <type>
      <types>CatalogRef.ОбъектыСтроительства</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтрокиДокумента</name>
    <comment>Индекс строки документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаПродукции</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияПродукции</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.СпецификацииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументВыпуска</name>
    <type>
      <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
      <types>DocumentRef.ОтчетПроизводстваЗаСмену</types>
      <types>DocumentRef.СписаниеНЗП</types>
      <types>DocumentRef.ОприходованиеНЗП</types>
      <types>DocumentRef.ПоступлениеТоваровИзПереработки</types>
      <types>DocumentRef.ОприходованиеМатериаловИзПроизводства</types>
      <types>DocumentRef.КомплектацияНоменклатуры</types>
      <types>DocumentRef.КорректировкаНЗП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Качество</name>
    <type>
      <types>CatalogRef.Качество</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/ЗатратыНаВыпускПродукцииБухгалтерскийУчет/ЗатратыНаВыпускПродукцииБухгалтерскийУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗатратыНаВыпускПродукцииБухгалтерскийУчет</name>
  <comment>(Регл)</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НДСВходящий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НДСКредит</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийЗатратыНаВыпускПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗатратыВстречногоВыпуска</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КосвенныеЗатраты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СписаниеНаработки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаПродукции</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияПродукции</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.СпецификацииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументВыпуска</name>
    <type>
      <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
      <types>DocumentRef.ОтчетПроизводстваЗаСмену</types>
      <types>DocumentRef.ПоступлениеТоваровИзПереработки</types>
      <types>DocumentRef.КомплектацияНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Затрата</name>
    <type>
      <types>EnumRef.ХарактерЗатрат</types>
      <types>CatalogRef.СпособыРаспределенияЗатратНаВыпуск</types>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаЗатраты</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияЗатраты</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатурнаяГруппаНЗП</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказНЗП</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодразделениеНЗП</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НалоговоеНазначение</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НалоговоеНазначениеПоФакту</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/КодыОперацийВыпускПродукции/КодыОперацийВыпускПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КодыОперацийВыпускПродукции</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ВозвратМатериаловИзПроизводстваРасч</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВыпускПродукцииПоФиксированнойСтоимости</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВыпускПродукцииФиксВнешниеУслуги</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВыпускПродукцииФиксВнутрУслугиНаПостЗатраты</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВыпускПродукцииФиксВнутрУслугиНаПроизводство</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВыпускПродукцииФиксВнутрУслугиНаСчет</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВыпускПродукцииФиксНаСклад</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СписаниеНЗП</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ФормированиеФактСебестоимости</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ОприходованиеНЗП</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>КорректировкаНЗПРасч</name>
  </enumValues>
  <enumValues>
    <name>КорректировкиНУ</name>
  </enumValues>
  <enumValues>
    <name>ВозвратМатериаловИзПроизводстваФикс</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СписаниеНЗПФикс</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>КорректировкаНЗПФикс</name>
  </enumValues>
</mdclass:Enum>

src/Enums/СтатусыМатериальныхЗатратНаПроизводство/СтатусыМатериальныхЗатратНаПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыМатериальныхЗатратНаПроизводство</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>Собственные</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПринятыеВПереработку</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратныеОтходы</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

src/Reports/АнализРаспределенияЗатрат/ObjectModule.bsl
#Если Клиент Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ НАЧАЛЬНОЙ НАСТРОЙКИ ОТЧЕТА

// Процедура установки начальных настроек отчета с использованием текста запроса
//
Процедура УстановитьНачальныеНастройкиУпр(ДополнительныеПараметры = Неопределено)
	
	// Дополнительные параметры, переданные из отчета, вызвавшего расшифровку.
	// Информация, передаваемая в переменной ДополнительныеПараметры, может быть использована
	// для реализации специфичных для данного отчета параметрических настроек.
	
	// Описание исходного текста запроса.
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Подразделение КАК Подразделение,
	|	ВложенныйЗапрос.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ВложенныйЗапрос.Продукция КАК Продукция,
	|	ВложенныйЗапрос.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
	|	ВложенныйЗапрос.СерияПродукции КАК СерияПродукции,
	|	ВложенныйЗапрос.Спецификация КАК Спецификация,
	|	ВложенныйЗапрос.Заказ КАК Заказ,
	|	ВложенныйЗапрос.ДокументВыпуска КАК ДокументВыпуска,
	|	ВложенныйЗапрос.СтатьяЗатрат КАК СтатьяЗатрат,
	|	ВложенныйЗапрос.Затрата КАК Затрата,
	|	ВложенныйЗапрос.ХарактеристикаЗатраты КАК ХарактеристикаЗатраты,
	|	ВложенныйЗапрос.СерияЗатраты КАК СерияЗатраты,
	|	ВложенныйЗапрос.КодОперации КАК КодОперации,
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.ПериодДень КАК ПериодДень,
	|	ВложенныйЗапрос.ПериодНеделя КАК ПериодНеделя,
	|	ВложенныйЗапрос.ПериодДекада КАК ПериодДекада,
	|	ВложенныйЗапрос.ПериодМесяц КАК ПериодМесяц,
	|	ВложенныйЗапрос.ПериодКвартал КАК ПериодКвартал,
	|	ВложенныйЗапрос.ПериодПолугодие КАК ПериодПолугодие,
	|	ВложенныйЗапрос.ПериодГод КАК ПериодГод,
	|	ВложенныйЗапрос.Регистратор КАК Регистратор,
	|	ВложенныйЗапрос.Количество КАК Количество,
	|	ВложенныйЗапрос.Стоимость КАК Стоимость,
	|	ВложенныйЗапрос.КоличествоВыпуск КАК КоличествоВыпуск,
	|	ВложенныйЗапрос.СтоимостьВыпуск КАК СтоимостьВыпуск,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Подразделение) КАК ПодразделениеПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.НоменклатурнаяГруппа) КАК НоменклатурнаяГруппаПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Продукция) КАК ПродукцияПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.ХарактеристикаПродукции) КАК ХарактеристикаПродукцииПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.СерияПродукции) КАК СерияПродукцииПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Спецификация) КАК СпецификацияПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Заказ) КАК ЗаказПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.ДокументВыпуска) КАК ДокументВыпускаПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.СтатьяЗатрат) КАК СтатьяЗатратПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Затрата) КАК ЗатратаПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.ХарактеристикаЗатраты) КАК ХарактеристикаЗатратыПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.СерияЗатраты) КАК СерияЗатратыПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.КодОперации) КАК КодОперацииПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Регистратор) КАК РегистраторПредставление
	|	//ПОЛЯ_СВОЙСТВА
	|	//ПОЛЯ_КАТЕГОРИИ
	|{ВЫБРАТЬ
	|	Подразделение.*,
	|	НоменклатурнаяГруппа.*,
	|	Продукция.*,
	|	ХарактеристикаПродукции.*,
	|	СерияПродукции.*,
	|	Спецификация.*,
	|	Заказ.*,
	|	ДокументВыпуска.*,
	|	СтатьяЗатрат.*,
	|	Затрата.*,
	|	ХарактеристикаЗатраты.*,
	|	СерияЗатраты.*,
	|	КодОперации.*,
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	Регистратор.*,
	|	Количество,
	|	Стоимость,
	|	КоличествоВыпуск,
	|	СтоимостьВыпуск
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Подразделение КАК Подразделение,
	|		ВложенныйЗапрос.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|		ВложенныйЗапрос.Продукция КАК Продукция,
	|		ВложенныйЗапрос.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
	|		ВложенныйЗапрос.СерияПродукции КАК СерияПродукции,
	|		ВложенныйЗапрос.Спецификация КАК Спецификация,
	|		ВложенныйЗапрос.Заказ КАК Заказ,
	|		ВложенныйЗапрос.ДокументВыпуска КАК ДокументВыпуска,
	|		ВложенныйЗапрос.СтатьяЗатрат КАК СтатьяЗатрат,
	|		ВложенныйЗапрос.Затрата КАК Затрата,
	|		ВложенныйЗапрос.ХарактеристикаЗатраты КАК ХарактеристикаЗатраты,
	|		ВложенныйЗапрос.СерияЗатраты КАК СерияЗатраты,
	|		ВложенныйЗапрос.КодОперации КАК КодОперации,
	|		ВложенныйЗапрос.Период КАК Период,
	|		ВложенныйЗапрос.ПериодДень КАК ПериодДень,
	|		ВложенныйЗапрос.ПериодНеделя КАК ПериодНеделя,
	|		ВложенныйЗапрос.ПериодДекада КАК ПериодДекада,
	|		ВложенныйЗапрос.ПериодМесяц КАК ПериодМесяц,
	|		ВложенныйЗапрос.ПериодКвартал КАК ПериодКвартал,
	|		ВложенныйЗапрос.ПериодПолугодие КАК ПериодПолугодие,
	|		ВложенныйЗапрос.ПериодГод КАК ПериодГод,
	|		ВложенныйЗапрос.Регистратор КАК Регистратор,
	|		СУММА(ВложенныйЗапрос.Количество) КАК Количество,
	|		СУММА(ВложенныйЗапрос.Стоимость) КАК Стоимость,
	|		СУММА(ВложенныйЗапрос.КоличествоВыпуск) КАК КоличествоВыпуск,
	|		СУММА(ВложенныйЗапрос.СтоимостьВыпуск) КАК СтоимостьВыпуск
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ЗатратыНаВыпускПродукции.Подразделение КАК Подразделение,
	|			ЗатратыНаВыпускПродукции.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|			ЗатратыНаВыпускПродукции.Продукция КАК Продукция,
	|			ЗатратыНаВыпускПродукции.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
	|			ЗатратыНаВыпускПродукции.СерияПродукции КАК СерияПродукции,
	|			ЗатратыНаВыпускПродукции.Спецификация КАК Спецификация,
	|			ЗатратыНаВыпускПродукции.Заказ КАК Заказ,
	|			ЗатратыНаВыпускПродукции.ДокументВыпуска КАК ДокументВыпуска,
	|			ЗатратыНаВыпускПродукции.СтатьяЗатрат КАК СтатьяЗатрат,
	|			ЗатратыНаВыпускПродукции.Затрата КАК Затрата,
	|			ЗатратыНаВыпускПродукции.ХарактеристикаЗатраты КАК ХарактеристикаЗатраты,
	|			ЗатратыНаВыпускПродукции.СерияЗатраты КАК СерияЗатраты,
	|			ЗатратыНаВыпускПродукции.КодОперации КАК КодОперации,
	|			ЗатратыНаВыпускПродукции.Период КАК Период,
	|			НАЧАЛОПЕРИОДА(ЗатратыНаВыпускПродукции.Период, ДЕНЬ) КАК ПериодДень,
	|			НАЧАЛОПЕРИОДА(ЗатратыНаВыпускПродукции.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	|			НАЧАЛОПЕРИОДА(ЗатратыНаВыпускПродукции.Период, ДЕКАДА) КАК ПериодДекада,
	|			НАЧАЛОПЕРИОДА(ЗатратыНаВыпускПродукции.Период, МЕСЯЦ) КАК ПериодМесяц,
	|			НАЧАЛОПЕРИОДА(ЗатратыНаВыпускПродукции.Период, КВАРТАЛ) КАК ПериодКвартал,
	|			НАЧАЛОПЕРИОДА(ЗатратыНаВыпускПродукции.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	|			НАЧАЛОПЕРИОДА(ЗатратыНаВыпускПродукции.Период, ГОД) КАК ПериодГод,
	|			ЗатратыНаВыпускПродукции.Регистратор КАК Регистратор,
	|			ЗатратыНаВыпускПродукции.Количество КАК Количество,
	|			ЗатратыНаВыпускПродукции.Сумма КАК Стоимость,
	|			0 КАК КоличествоВыпуск,
	|			0 КАК СтоимостьВыпуск
	|		ИЗ
	|			РегистрНакопления.ЗатратыНаВыпускПродукции КАК ЗатратыНаВыпускПродукции
	|		ГДЕ
	|			ЗатратыНаВыпускПродукции.Период МЕЖДУ &ДатаНачала И &ДатаКонца
	|			И ЗатратыНаВыпускПродукции.СтатьяЗатрат.СтатусМатериальныхЗатрат <> &СтатусыМатериальныхЗатратНаПроизводствоПринятыеВПереработку
	|		{ГДЕ
	|			ЗатратыНаВыпускПродукции.Подразделение.* КАК Подразделение,
	|			ЗатратыНаВыпускПродукции.НоменклатурнаяГруппа.* КАК НоменклатурнаяГруппа,
	|			ЗатратыНаВыпускПродукции.Продукция.* КАК Продукция,
	|			ЗатратыНаВыпускПродукции.ХарактеристикаПродукции.* КАК ХарактеристикаПродукции,
	|			ЗатратыНаВыпускПродукции.СерияПродукции.* КАК СерияПродукции,
	|			ЗатратыНаВыпускПродукции.Спецификация.* КАК Спецификация,
	|			ЗатратыНаВыпускПродукции.Заказ.* КАК Заказ,
	|			ЗатратыНаВыпускПродукции.ДокументВыпуска.* КАК ДокументВыпуска,
	|			ЗатратыНаВыпускПродукции.СтатьяЗатрат.* КАК СтатьяЗатрат,
	|			ЗатратыНаВыпускПродукции.Затрата.* КАК Затрата,
	|			ЗатратыНаВыпускПродукции.ХарактеристикаЗатраты.* КАК ХарактеристикаЗатраты,
	|			ЗатратыНаВыпускПродукции.СерияЗатраты.* КАК СерияЗатраты,
	|			ЗатратыНаВыпускПродукции.КодОперации.* КАК КодОперации,
	|			ЗатратыНаВыпускПродукции.Период КАК Период,
	|			НАЧАЛОПЕРИОДА(ЗатратыНаВыпускПродукции.Период, ДЕНЬ) КАК ПериодДень,
	|			НАЧАЛОПЕРИОДА(ЗатратыНаВыпускПродукции.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	|			НАЧАЛОПЕРИОДА(ЗатратыНаВыпускПродукции.Период, ДЕКАДА) КАК ПериодДекада,
	|			НАЧАЛОПЕРИОДА(ЗатратыНаВыпускПродукции.Период, МЕСЯЦ) КАК ПериодМесяц,
	|			НАЧАЛОПЕРИОДА(ЗатратыНаВыпускПродукции.Период, КВАРТАЛ) КАК ПериодКвартал,
	|			НАЧАЛОПЕРИОДА(ЗатратыНаВыпускПродукции.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	|			НАЧАЛОПЕРИОДА(ЗатратыНаВыпускПродукции.Период, ГОД) КАК ПериодГод,
	|			ЗатратыНаВыпускПродукции.Регистратор.* КАК Регистратор}
	|
	|		ОБЪЕДИНИТЬ ВСЕ
	|
	|		ВЫБРАТЬ
	|			ВыпускПродукции.Подразделение КАК Подразделение,
	|			ВыпускПродукции.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|			ВыпускПродукции.Продукция КАК Продукция,
	|			ВыпускПродукции.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
	|			ВыпускПродукции.СерияПродукции КАК СерияПродукции,
	|			ВыпускПродукции.Спецификация КАК Спецификация,
	|			ВыпускПродукции.Заказ КАК Заказ,
	|			ВыпускПродукции.ДокументВыпуска КАК ДокументВыпуска,
	|			NULL КАК СтатьяЗатрат,
	|			NULL КАК Затрата,
	|			NULL КАК ХарактеристикаЗатраты,
	|			NULL КАК СерияЗатраты,
	|			ВыпускПродукции.КодОперации КАК КодОперации,
	|			ВыпускПродукции.Период КАК Период,
	|			НАЧАЛОПЕРИОДА(ВыпускПродукции.Период, ДЕНЬ) КАК ПериодДень,
	|			НАЧАЛОПЕРИОДА(ВыпускПродукции.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	|			НАЧАЛОПЕРИОДА(ВыпускПродукции.Период, ДЕКАДА) КАК ПериодДекада,
	|			НАЧАЛОПЕРИОДА(ВыпускПродукции.Период, МЕСЯЦ) КАК ПериодМесяц,
	|			НАЧАЛОПЕРИОДА(ВыпускПродукции.Период, КВАРТАЛ) КАК ПериодКвартал,
	|			НАЧАЛОПЕРИОДА(ВыпускПродукции.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	|			НАЧАЛОПЕРИОДА(ВыпускПродукции.Период, ГОД) КАК ПериодГод,
	|			ВыпускПродукции.Регистратор КАК Регистратор,
	|			0 КАК Количество,
	|			0 КАК Стоимость,
	|			ВыпускПродукции.Количество КАК КоличествоВыпуск,
	|			ВыпускПродукции.Стоимость КАК СтоимостьВыпуск
	|		ИЗ
	|			РегистрНакопления.ВыпускПродукции КАК ВыпускПродукции
	|		ГДЕ
	|			ВыпускПродукции.Период МЕЖДУ &ДатаНачала И &ДатаКонца
	|			И (НЕ ВыпускПродукции.КодОперации В (&МассивКодовОперацийИсключение))
	|		{ГДЕ
	|			ВыпускПродукции.Подразделение.* КАК Подразделение,
	|			ВыпускПродукции.НоменклатурнаяГруппа.* КАК НоменклатурнаяГруппа,
	|			ВыпускПродукции.Продукция.* КАК Продукция,
	|			ВыпускПродукции.ХарактеристикаПродукции.* КАК ХарактеристикаПродукции,
	|			ВыпускПродукции.СерияПродукции.* КАК СерияПродукции,
	|			ВыпускПродукции.Спецификация.* КАК Спецификация,
	|			ВыпускПродукции.Заказ.* КАК Заказ,
	|			ВыпускПродукции.ДокументВыпуска.* КАК ДокументВыпуска,
	|			ВыпускПродукции.КодОперации.* КАК КодОперации,
	|			ВыпускПродукции.Период КАК Период,
	|			НАЧАЛОПЕРИОДА(ВыпускПродукции.Период, ДЕНЬ) КАК ПериодДень,
	|			НАЧАЛОПЕРИОДА(ВыпускПродукции.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	|			НАЧАЛОПЕРИОДА(ВыпускПродукции.Период, ДЕКАДА) КАК ПериодДекада,
	|			НАЧАЛОПЕРИОДА(ВыпускПродукции.Период, МЕСЯЦ) КАК ПериодМесяц,
	|			НАЧАЛОПЕРИОДА(ВыпускПродукции.Период, КВАРТАЛ) КАК ПериодКвартал,
	|			НАЧАЛОПЕРИОДА(ВыпускПродукции.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	|			НАЧАЛОПЕРИОДА(ВыпускПродукции.Период, ГОД) КАК ПериодГод,
	|			ВыпускПродукции.Регистратор.* КАК Регистратор}) КАК ВложенныйЗапрос
	|
	|	СГРУППИРОВАТЬ ПО
	|		ВложенныйЗапрос.Подразделение,
	|		ВложенныйЗапрос.НоменклатурнаяГруппа,
	|		ВложенныйЗапрос.Продукция,
	|		ВложенныйЗапрос.ХарактеристикаПродукции,
	|		ВложенныйЗапрос.СерияПродукции,
	|		ВложенныйЗапрос.Спецификация,
	|		ВложенныйЗапрос.Заказ,
	|		ВложенныйЗапрос.ДокументВыпуска,
	|		ВложенныйЗапрос.СтатьяЗатрат,
	|		ВложенныйЗапрос.Затрата,
	|		ВложенныйЗапрос.ХарактеристикаЗатраты,
	|		ВложенныйЗапрос.СерияЗатраты,
	|		ВложенныйЗапрос.КодОперации,
	|		ВложенныйЗапрос.Период,
	|		ВложенныйЗапрос.ПериодДень,
	|		ВложенныйЗапрос.ПериодНеделя,
	|		ВложенныйЗапрос.ПериодДекада,
	|		ВложенныйЗапрос.ПериодМесяц,
	|		ВложенныйЗапрос.ПериодКвартал,
	|		ВложенныйЗапрос.ПериодПолугодие,
	|		ВложенныйЗапрос.ПериодГод,
	|		ВложенныйЗапрос.Регистратор) КАК ВложенныйЗапрос
	|	//СОЕДИНЕНИЯ
	|{ГДЕ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.ПериодДень КАК ПериодДень,
	|	ВложенныйЗапрос.ПериодНеделя КАК ПериодНеделя,
	|	ВложенныйЗапрос.ПериодДекада КАК ПериодДекада,
	|	ВложенныйЗапрос.ПериодМесяц КАК ПериодМесяц,
	|	ВложенныйЗапрос.ПериодКвартал КАК ПериодКвартал,
	|	ВложенныйЗапрос.ПериодПолугодие КАК ПериодПолугодие,
	|	ВложенныйЗапрос.ПериодГод КАК ПериодГод,
	|	ВложенныйЗапрос.Регистратор КАК Регистратор,
	|	ВложенныйЗапрос.Количество КАК Количество,
	|	ВложенныйЗапрос.Стоимость КАК Стоимость,
	|	ВложенныйЗапрос.КоличествоВыпуск КАК КоличествоВыпуск,
	|	ВложенныйЗапрос.СтоимостьВыпуск КАК СтоимостьВыпуск
	|	//УСЛОВИЯ_СВОЙСТВА
	|	//УСЛОВИЯ_КАТЕГОРИИ
	|}
	|{УПОРЯДОЧИТЬ ПО
	|	Подразделение.*,
	|	НоменклатурнаяГруппа.*,
	|	Продукция.*,
	|	ХарактеристикаПродукции.*,
	|	СерияПродукции.*,
	|	Спецификация.*,
	|	Заказ.*,
	|	ДокументВыпуска.*,
	|	СтатьяЗатрат.*,
	|	Затрата.*,
	|	ХарактеристикаЗатраты.*,
	|	СерияЗатраты.*,
	|	КодОперации.*,
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	Регистратор.*,
	|	Количество,
	|	Стоимость,
	|	КоличествоВыпуск,
	|	СтоимостьВыпуск
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Стоимость),
	|	СУММА(КоличествоВыпуск),
	|	СУММА(СтоимостьВыпуск)
	|	//ИТОГИ_СВОЙСТВА
	|	//ИТОГИ_КАТЕГОРИИ
	|ПО
	|	ОБЩИЕ
	|{ИТОГИ ПО
	|	Подразделение.*,
	|	НоменклатурнаяГруппа.*,
	|	Продукция.*,
	|	ХарактеристикаПродукции.*,
	|	СерияПродукции.*,
	|	Спецификация.*,
	|	Заказ.*,
	|	ДокументВыпуска.*,
	|	СтатьяЗатрат.*,
	|	Затрата.*,
	|	ХарактеристикаЗатраты.*,
	|	СерияЗатраты.*,
	|	КодОперации.*,
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	Регистратор.*
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}";
	
	// В универсальном отчете включен флаг использования свойств и категорий.
	Если УниверсальныйОтчет.ИспользоватьСвойстваИКатегории Тогда
		
		// Добавление свойств и категорий поля запроса в таблицу полей.
		// Необходимо вызывать для каждого поля запроса, предоставляющего возможность использования свойств и категорий.
		
		// УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля(<ПсевдонимТаблицы>.<Поле> , <ПсевдонимПоля>, <Представление>, <Назначение>);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("Подразделение", "Подразделение", "Подразделение", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Подразделения);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("НоменклатурнаяГруппа", "НоменклатурнаяГруппа", "Номенклатурная группа", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_НоменклатурныеГруппы);
        УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("Продукция", "Продукция", "Продукция", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура);
        УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ХарактеристикаПродукции", "ХарактеристикаПродукции", "Характеристика продукции", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ХарактеристикиНоменклатуры);
        УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("Затрата", "Затрата", "Затрата", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура);
        УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ХарактеристикаЗатраты", "ХарактеристикаЗатраты", "Характеристика затраты", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ХарактеристикиНоменклатуры);

		// Добавление свойств и категорий в исходный текст запроса.
		УниверсальныйОтчет.ДобавитьВТекстЗапросаСвойстваИКатегории(ТекстЗапроса);
		
	КонецЕсли;
		
	// Инициализация текста запроса построителя отчета
	УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;
	
	// Представления полей отчета.
	// Необходимо вызывать для каждого поля запроса.
	// УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить(<ИмяПоля>, <ПредставлениеПоля>);
	
	// Представления предопределенных полей запроса.
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Подразделение", "Подразделение");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НоменклатурнаяГруппа", "Номенклатурная группа");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Продукция", "Продукция");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ХарактеристикаПродукции", "Характеристика продукции");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СерияПродукции", "Серия продукции");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Спецификация", "Спецификация");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Заказ", "Заказ");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ДокументВыпуска", "Документ выпуска");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтатьяЗатрат", "Статья затрат");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Затрата", "Затрата");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ХарактеристикаЗатраты", "Характеристика затраты");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СерияЗатраты", "Серия затраты");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КодОперации", "Код операции");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Количество", "Количество (затраты)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Стоимость", "Стоимость (затраты)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоВыпуск", "Количество (выпуск)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтоимостьВыпуск", "Стоимость (выпуск)");
	
	// Добавление показателей
	// Необходимо вызывать для каждого добавляемого показателя.
	// УниверсальныйОтчет.ДобавитьПоказатель(<ИмяПоказателя>, <ПредставлениеПоказателя>, <ВключенПоУмолчанию>, <Формат>, <ИмяГруппы>, <ПредставлениеГруппы>);
	УниверсальныйОтчет.ДобавитьПоказатель("Количество", "Количество", Истина, "ЧЦ=15; ЧДЦ=3", "Затраты", "Затраты");
	УниверсальныйОтчет.ДобавитьПоказатель("Стоимость", "Стоимость", Истина, "ЧЦ=15; ЧДЦ=2""Затраты", "Затраты");
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоВыпуск", "Количество", Истина, "ЧЦ=15; ЧДЦ=3", "Выпуск", "Выпуск");
	УниверсальныйОтчет.ДобавитьПоказатель("СтоимостьВыпуск", "Стоимость", Истина, "ЧЦ=15; ЧДЦ=2", "Выпуск", "Выпуск");
	
	// Добавление предопредедленных группировок строк отчета.
	// Необходимо вызывать для каждой добавляемой группировки строки.
	// УниверсальныйОтчет.ДобавитьИзмерениеСтроки(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Подразделение");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Продукция");
	
	// Добавление предопредедленных группировок колонок отчета.
	// Необходимо вызывать для каждой добавляемой группировки колонки.
	// УниверсальныйОтчет.ДобавитьИзмерениеКолонки(<ПутьКДанным>);
	
	// Добавление предопредедленных отборов отчета.
	// Необходимо вызывать для каждого добавляемого отбора.
	// УниверсальныйОтчет.ДобавитьОтбор(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьОтбор("Подразделение");
	УниверсальныйОтчет.ДобавитьОтбор("Продукция");
	УниверсальныйОтчет.ДобавитьОтбор("СтатьяЗатрат");
	УниверсальныйОтчет.ДобавитьОтбор("Затрата");
	
	// Установка связи подчиненных и родительских полей
	// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДаннымРодитель>);
	
	// Установка представлений полей
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	// Установка типов значений свойств в отборах отчета
	УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	// УниверсальныйОтчет.ДобавитьДополнительноеПоле(<ПутьКДанным>);
	
КонецПроцедуры // УстановитьНачальныеНастройкиУпр()

// Процедура установки начальных настроек отчета с использованием текста запроса
//
Процедура УстановитьНачальныеНастройкиБух(ДополнительныеПараметры = Неопределено)
	
	// Дополнительные параметры, переданные из отчета, вызвавшего расшифровку.
	// Информация, передаваемая в переменной ДополнительныеПараметры, может быть использована
	// для реализации специфичных для данного отчета параметрических настроек.
	
	// Описание исходного текста запроса.
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.СчетУчета КАК СчетУчета,
	|	ВложенныйЗапрос.Подразделение КАК Подразделение,
	|	ВложенныйЗапрос.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ВложенныйЗапрос.Продукция КАК Продукция,
	|	ВложенныйЗапрос.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
	|	ВложенныйЗапрос.СерияПродукции КАК СерияПродукции,
	|	ВложенныйЗапрос.Спецификация КАК Спецификация,
	|	ВложенныйЗапрос.Заказ КАК Заказ,
	|	ВложенныйЗапрос.ДокументВыпуска КАК ДокументВыпуска,
	|	ВложенныйЗапрос.СтатьяЗатрат КАК СтатьяЗатрат,
	|	ВложенныйЗапрос.Затрата КАК Затрата,
	|	ВложенныйЗапрос.ХарактеристикаЗатраты КАК ХарактеристикаЗатраты,
	|	ВложенныйЗапрос.СерияЗатраты КАК СерияЗатраты,
	|	ВложенныйЗапрос.КодОперации КАК КодОперации,
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.ПериодДень КАК ПериодДень,
	|	ВложенныйЗапрос.ПериодНеделя КАК ПериодНеделя,
	|	ВложенныйЗапрос.ПериодДекада КАК ПериодДекада,
	|	ВложенныйЗапрос.ПериодМесяц КАК ПериодМесяц,
	|	ВложенныйЗапрос.ПериодКвартал КАК ПериодКвартал,
	|	ВложенныйЗапрос.ПериодПолугодие КАК ПериодПолугодие,
	|	ВложенныйЗапрос.ПериодГод КАК ПериодГод,
	|	ВложенныйЗапрос.Регистратор КАК Регистратор,
	|	ВложенныйЗапрос.Количество КАК Количество,
	|	ВложенныйЗапрос.Стоимость КАК Стоимость,
	|	ВложенныйЗапрос.КоличествоВыпуск КАК КоличествоВыпуск,
	|	ВложенныйЗапрос.СтоимостьВыпуск КАК СтоимостьВыпуск,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Организация) КАК ОрганизацияПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.СчетУчета) КАК СчетУчетаПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Подразделение) КАК ПодразделениеПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.НоменклатурнаяГруппа) КАК НоменклатурнаяГруппаПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Продукция) КАК ПродукцияПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.ХарактеристикаПродукции) КАК ХарактеристикаПродукцииПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.СерияПродукции) КАК СерияПродукцииПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Спецификация) КАК СпецификацияПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Заказ) КАК ЗаказПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.ДокументВыпуска) КАК ДокументВыпускаПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.СтатьяЗатрат) КАК СтатьяЗатратПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Затрата) КАК ЗатратаПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.ХарактеристикаЗатраты) КАК ХарактеристикаЗатратыПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.СерияЗатраты) КАК СерияЗатратыПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.КодОперации) КАК КодОперацииПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Регистратор) КАК РегистраторПредставление,
	|	ВложенныйЗапрос.СтоимостьНУ КАК СтоимостьНУ,
	|	ВложенныйЗапрос.СтоимостьВыпускНУ КАК СтоимостьВыпускНУ,
	|	ВложенныйЗапрос.НДСВходящий КАК НДСВходящий,
    |	ВложенныйЗапрос.НДСКредит КАК НДСКредит,
    |	ВложенныйЗапрос.НДСВходящийВыпуск КАК НДСВходящийВыпуск,
    |	ВложенныйЗапрос.НДСКредитВыпуск КАК НДСКредитВыпуск,
    |	ВложенныйЗапрос.НалоговоеНазначение
	|	//ПОЛЯ_СВОЙСТВА
	|	//ПОЛЯ_КАТЕГОРИИ
	|{ВЫБРАТЬ
	|	Организация.*,
	|	СчетУчета.*,
	|	Подразделение.*,
	|	НоменклатурнаяГруппа.*,
	|	Продукция.*,
	|	ХарактеристикаПродукции.*,
	|	СерияПродукции.*,
	|	Спецификация.*,
	|	Заказ.*,
	|	ДокументВыпуска.*,
	|	СтатьяЗатрат.*,
	|	Затрата.*,
	|	ХарактеристикаЗатраты.*,
	|	СерияЗатраты.*,
	|	КодОперации.*,
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	Регистратор.*,
	|	Количество,
	|	Стоимость,
	|	КоличествоВыпуск,
	|	СтоимостьВыпуск,
	|	СтоимостьНУ,
	|	СтоимостьВыпускНУ,
    |	НДСВходящий,
    |	НДСКредит,
    |	НДСВходящийВыпуск,
    |	НДСКредитВыпуск,
    |	НалоговоеНазначение.*
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		ВложенныйЗапрос.СчетУчета КАК СчетУчета,
	|		ВложенныйЗапрос.Подразделение КАК Подразделение,
	|		ВложенныйЗапрос.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|		ВложенныйЗапрос.Продукция КАК Продукция,
	|		ВложенныйЗапрос.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
	|		ВложенныйЗапрос.СерияПродукции КАК СерияПродукции,
	|		ВложенныйЗапрос.Спецификация КАК Спецификация,
	|		ВложенныйЗапрос.Заказ КАК Заказ,
	|		ВложенныйЗапрос.ДокументВыпуска КАК ДокументВыпуска,
	|		ВложенныйЗапрос.СтатьяЗатрат КАК СтатьяЗатрат,
	|		ВложенныйЗапрос.Затрата КАК Затрата,
	|		ВложенныйЗапрос.ХарактеристикаЗатраты КАК ХарактеристикаЗатраты,
	|		ВложенныйЗапрос.СерияЗатраты КАК СерияЗатраты,
	|		ВложенныйЗапрос.КодОперации КАК КодОперации,
	|		ВложенныйЗапрос.Период КАК Период,
	|		ВложенныйЗапрос.ПериодДень КАК ПериодДень,
	|		ВложенныйЗапрос.ПериодНеделя КАК ПериодНеделя,
	|		ВложенныйЗапрос.ПериодДекада КАК ПериодДекада,
	|		ВложенныйЗапрос.ПериодМесяц КАК ПериодМесяц,
	|		ВложенныйЗапрос.ПериодКвартал КАК ПериодКвартал,
	|		ВложенныйЗапрос.ПериодПолугодие КАК ПериодПолугодие,
	|		ВложенныйЗапрос.ПериодГод КАК ПериодГод,
	|		ВложенныйЗапрос.Регистратор КАК Регистратор,
	|		СУММА(ВложенныйЗапрос.Количество) КАК Количество,
	|		СУММА(ВложенныйЗапрос.Стоимость) КАК Стоимость,
	|		СУММА(ВложенныйЗапрос.КоличествоВыпуск) КАК КоличествоВыпуск,
	|		СУММА(ВложенныйЗапрос.СтоимостьВыпуск) КАК СтоимостьВыпуск,
	|		СУММА(ВложенныйЗапрос.СтоимостьНУ) КАК СтоимостьНУ,
	|		СУММА(ВложенныйЗапрос.СтоимостьВыпускНУ) КАК СтоимостьВыпускНУ,
    |		СУММА(ВложенныйЗапрос.НДСВходящий) КАК НДСВходящий,
    |		СУММА(ВложенныйЗапрос.НДСКредит) КАК НДСКредит,
    |		СУММА(ВложенныйЗапрос.НДСВходящийВыпуск) КАК НДСВходящийВыпуск,
    |		СУММА(ВложенныйЗапрос.НДСКредитВыпуск) КАК НДСКредитВыпуск,
    |		ВложенныйЗапрос.НалоговоеНазначение КАК НалоговоеНазначение
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ЗатратыНаВыпускПродукцииБухгалтерскийУчет.Организация КАК Организация,
	|			ЗатратыНаВыпускПродукцииБухгалтерскийУчет.СчетУчета КАК СчетУчета,
	|			ЗатратыНаВыпускПродукцииБухгалтерскийУчет.Подразделение КАК Подразделение,
	|			ЗатратыНаВыпускПродукцииБухгалтерскийУчет.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|			ЗатратыНаВыпускПродукцииБухгалтерскийУчет.Продукция КАК Продукция,
	|			ЗатратыНаВыпускПродукцииБухгалтерскийУчет.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
	|			ЗатратыНаВыпускПродукцииБухгалтерскийУчет.СерияПродукции КАК СерияПродукции,
	|			ЗатратыНаВыпускПродукцииБухгалтерскийУчет.Спецификация КАК Спецификация,
	|			ЗатратыНаВыпускПродукцииБухгалтерскийУчет.Заказ КАК Заказ,
	|			ЗатратыНаВыпускПродукцииБухгалтерскийУчет.ДокументВыпуска КАК ДокументВыпуска,
	|			ЗатратыНаВыпускПродукцииБухгалтерскийУчет.СтатьяЗатрат КАК СтатьяЗатрат,
	|			ЗатратыНаВыпускПродукцииБухгалтерскийУчет.Затрата КАК Затрата,
	|			ЗатратыНаВыпускПродукцииБухгалтерскийУчет.ХарактеристикаЗатраты КАК ХарактеристикаЗатраты,
	|			ЗатратыНаВыпускПродукцииБухгалтерскийУчет.СерияЗатраты КАК СерияЗатраты,
	|			ЗатратыНаВыпускПродукцииБухгалтерскийУчет.КодОперации КАК КодОперации,
	|			ЗатратыНаВыпускПродукцииБухгалтерскийУчет.Период КАК Период,
	|			НАЧАЛОПЕРИОДА(ЗатратыНаВыпускПродукцииБухгалтерскийУчет.Период, ДЕНЬ) КАК ПериодДень,
	|			НАЧАЛОПЕРИОДА(ЗатратыНаВыпускПродукцииБухгалтерскийУчет.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	|			НАЧАЛОПЕРИОДА(ЗатратыНаВыпускПродукцииБухгалтерскийУчет.Период, ДЕКАДА) КАК ПериодДекада,
	|			НАЧАЛОПЕРИОДА(ЗатратыНаВыпускПродукцииБухгалтерскийУчет.Период, МЕСЯЦ) КАК ПериодМесяц,
	|			НАЧАЛОПЕРИОДА(ЗатратыНаВыпускПродукцииБухгалтерскийУчет.Период, КВАРТАЛ) КАК ПериодКвартал,
	|			НАЧАЛОПЕРИОДА(ЗатратыНаВыпускПродукцииБухгалтерскийУчет.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	|			НАЧАЛОПЕРИОДА(ЗатратыНаВыпускПродукцииБухгалтерскийУчет.Период, ГОД) КАК ПериодГод,
	|			ЗатратыНаВыпускПродукцииБухгалтерскийУчет.Регистратор КАК Регистратор,
	|			ЗатратыНаВыпускПродукцииБухгалтерскийУчет.Количество КАК Количество,
	|			ЗатратыНаВыпускПродукцииБухгалтерскийУчет.Сумма КАК Стоимость,
	|			0 КАК КоличествоВыпуск,
	|			0 КАК СтоимостьВыпуск,
	|			ЗатратыНаВыпускПродукцииБухгалтерскийУчет.СуммаНУ КАК СтоимостьНУ,
	|			0 КАК СтоимостьВыпускНУ,
    |			ЗатратыНаВыпускПродукцииБухгалтерскийУчет.НДСВходящий КАК НДСВходящий,
    |			ЗатратыНаВыпускПродукцииБухгалтерскийУчет.НДСКредит КАК НДСКредит,
    |			0 КАК НДСВходящийВыпуск,
    |			0 КАК НДСКредитВыпуск,
    |			ЗатратыНаВыпускПродукцииБухгалтерскийУчет.НалоговоеНазначениеПоФакту КАК НалоговоеНазначение
	|		ИЗ
	|			РегистрНакопления.ЗатратыНаВыпускПродукцииБухгалтерскийУчет КАК ЗатратыНаВыпускПродукцииБухгалтерскийУчет
	|		ГДЕ
	|			ЗатратыНаВыпускПродукцииБухгалтерскийУчет.Период МЕЖДУ &ДатаНачала И &ДатаКонца
	|			И ЗатратыНаВыпускПродукцииБухгалтерскийУчет.СтатьяЗатрат.СтатусМатериальныхЗатрат <> &СтатусыМатериальныхЗатратНаПроизводствоПринятыеВПереработку
	|		{ГДЕ
	|			ЗатратыНаВыпускПродукцииБухгалтерскийУчет.Организация.* КАК Организация,
	|			ЗатратыНаВыпускПродукцииБухгалтерскийУчет.СчетУчета.* КАК СчетУчета,
	|			ЗатратыНаВыпускПродукцииБухгалтерскийУчет.Подразделение.* КАК Подразделение,
	|			ЗатратыНаВыпускПродукцииБухгалтерскийУчет.НоменклатурнаяГруппа.* КАК НоменклатурнаяГруппа,
	|			ЗатратыНаВыпускПродукцииБухгалтерскийУчет.Продукция.* КАК Продукция,
	|			ЗатратыНаВыпускПродукцииБухгалтерскийУчет.ХарактеристикаПродукции.* КАК ХарактеристикаПродукции,
	|			ЗатратыНаВыпускПродукцииБухгалтерскийУчет.СерияПродукции.* КАК СерияПродукции,
	|			ЗатратыНаВыпускПродукцииБухгалтерскийУчет.Спецификация.* КАК Спецификация,
	|			ЗатратыНаВыпускПродукцииБухгалтерскийУчет.Заказ.* КАК Заказ,
	|			ЗатратыНаВыпускПродукцииБухгалтерскийУчет.ДокументВыпуска.* КАК ДокументВыпуска,
	|			ЗатратыНаВыпускПродукцииБухгалтерскийУчет.СтатьяЗатрат.* КАК СтатьяЗатрат,
	|			ЗатратыНаВыпускПродукцииБухгалтерскийУчет.Затрата.* КАК Затрата,
	|			ЗатратыНаВыпускПродукцииБухгалтерскийУчет.ХарактеристикаЗатраты.* КАК ХарактеристикаЗатраты,
	|			ЗатратыНаВыпускПродукцииБухгалтерскийУчет.СерияЗатраты.* КАК СерияЗатраты,
	|			ЗатратыНаВыпускПродукцииБухгалтерскийУчет.КодОперации.* КАК КодОперации,
	|			ЗатратыНаВыпускПродукцииБухгалтерскийУчет.Период КАК Период,
	|			НАЧАЛОПЕРИОДА(ЗатратыНаВыпускПродукцииБухгалтерскийУчет.Период, ДЕНЬ) КАК ПериодДень,
	|			НАЧАЛОПЕРИОДА(ЗатратыНаВыпускПродукцииБухгалтерскийУчет.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	|			НАЧАЛОПЕРИОДА(ЗатратыНаВыпускПродукцииБухгалтерскийУчет.Период, ДЕКАДА) КАК ПериодДекада,
	|			НАЧАЛОПЕРИОДА(ЗатратыНаВыпускПродукцииБухгалтерскийУчет.Период, МЕСЯЦ) КАК ПериодМесяц,
	|			НАЧАЛОПЕРИОДА(ЗатратыНаВыпускПродукцииБухгалтерскийУчет.Период, КВАРТАЛ) КАК ПериодКвартал,
	|			НАЧАЛОПЕРИОДА(ЗатратыНаВыпускПродукцииБухгалтерскийУчет.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	|			НАЧАЛОПЕРИОДА(ЗатратыНаВыпускПродукцииБухгалтерскийУчет.Период, ГОД) КАК ПериодГод,
	|			ЗатратыНаВыпускПродукцииБухгалтерскийУчет.Регистратор.* КАК Регистратор}
	|
	|		ОБЪЕДИНИТЬ ВСЕ
	|
	|		ВЫБРАТЬ
	|			ВыпускПродукцииБухгалтерскийУчет.Организация КАК Организация,
	|			ВыпускПродукцииБухгалтерскийУчет.СчетУчетаНЗП КАК СчетУчета,
	|			ВыпускПродукцииБухгалтерскийУчет.Подразделение КАК Подразделение,
	|			ВыпускПродукцииБухгалтерскийУчет.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|			ВыпускПродукцииБухгалтерскийУчет.Продукция КАК Продукция,
	|			ВыпускПродукцииБухгалтерскийУчет.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
	|			ВыпускПродукцииБухгалтерскийУчет.СерияПродукции КАК СерияПродукции,
	|			ВыпускПродукцииБухгалтерскийУчет.Спецификация КАК Спецификация,
	|			ВыпускПродукцииБухгалтерскийУчет.Заказ КАК Заказ,
	|			ВыпускПродукцииБухгалтерскийУчет.ДокументВыпуска КАК ДокументВыпуска,
	|			NULL КАК СтатьяЗатрат,
	|			NULL КАК Затрата,
	|			NULL КАК ХарактеристикаЗатраты,
	|			NULL КАК СерияЗатраты,
	|			ВыпускПродукцииБухгалтерскийУчет.КодОперации КАК КодОперации,
	|			ВыпускПродукцииБухгалтерскийУчет.Период КАК Период,
	|			НАЧАЛОПЕРИОДА(ВыпускПродукцииБухгалтерскийУчет.Период, ДЕНЬ) КАК ПериодДень,
	|			НАЧАЛОПЕРИОДА(ВыпускПродукцииБухгалтерскийУчет.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	|			НАЧАЛОПЕРИОДА(ВыпускПродукцииБухгалтерскийУчет.Период, ДЕКАДА) КАК ПериодДекада,
	|			НАЧАЛОПЕРИОДА(ВыпускПродукцииБухгалтерскийУчет.Период, МЕСЯЦ) КАК ПериодМесяц,
	|			НАЧАЛОПЕРИОДА(ВыпускПродукцииБухгалтерскийУчет.Период, КВАРТАЛ) КАК ПериодКвартал,
	|			НАЧАЛОПЕРИОДА(ВыпускПродукцииБухгалтерскийУчет.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	|			НАЧАЛОПЕРИОДА(ВыпускПродукцииБухгалтерскийУчет.Период, ГОД) КАК ПериодГод,
	|			ВыпускПродукцииБухгалтерскийУчет.Регистратор КАК Регистратор,
	|			0 КАК Количество,
	|			0 КАК Стоимость,
	|			ВыпускПродукцииБухгалтерскийУчет.Количество КАК КоличествоВыпуск,
	|			ВыпускПродукцииБухгалтерскийУчет.Стоимость КАК СтоимостьВыпуск,
	|			ВыпускПродукцииБухгалтерскийУчет.СтоимостьНУ КАК СтоимостьНУ,
	|			0 КАК СтоимостьВыпускНУ,
    |			ВыпускПродукцииБухгалтерскийУчет.НДСВходящий КАК НДСВходящий,
    |			ВыпускПродукцииБухгалтерскийУчет.НДСКредит КАК НДСКредит,
    |			0 КАК НДСВходящийВыпуск,
    |			0 КАК НДСКредитВыпуск,
    |			ВыпускПродукцииБухгалтерскийУчет.НалоговоеНазначение КАК НалоговоеНазначение
	|		ИЗ
	|			РегистрНакопления.ВыпускПродукцииБухгалтерскийУчет КАК ВыпускПродукцииБухгалтерскийУчет
	|		ГДЕ
	|			ВыпускПродукцииБухгалтерскийУчет.Период МЕЖДУ &ДатаНачала И &ДатаКонца
	|			И (НЕ ВыпускПродукцииБухгалтерскийУчет.КодОперации В (&МассивКодовОперацийИсключение))
	|		{ГДЕ
	|			ВыпускПродукцииБухгалтерскийУчет.Организация.* КАК Организация,
	|			ВыпускПродукцииБухгалтерскийУчет.СчетУчетаНЗП.* КАК СчетУчета,
	|			ВыпускПродукцииБухгалтерскийУчет.Подразделение.* КАК Подразделение,
	|			ВыпускПродукцииБухгалтерскийУчет.НоменклатурнаяГруппа.* КАК НоменклатурнаяГруппа,
	|			ВыпускПродукцииБухгалтерскийУчет.Продукция.* КАК Продукция,
	|			ВыпускПродукцииБухгалтерскийУчет.ХарактеристикаПродукции.* КАК ХарактеристикаПродукции,
	|			ВыпускПродукцииБухгалтерскийУчет.СерияПродукции.* КАК СерияПродукции,
	|			ВыпускПродукцииБухгалтерскийУчет.Спецификация.* КАК Спецификация,
	|			ВыпускПродукцииБухгалтерскийУчет.Заказ.* КАК Заказ,
	|			ВыпускПродукцииБухгалтерскийУчет.ДокументВыпуска.* КАК ДокументВыпуска,
	|			ВыпускПродукцииБухгалтерскийУчет.КодОперации.* КАК КодОперации,
	|			ВыпускПродукцииБухгалтерскийУчет.Период КАК Период,
	|			НАЧАЛОПЕРИОДА(ВыпускПродукцииБухгалтерскийУчет.Период, ДЕНЬ) КАК ПериодДень,
	|			НАЧАЛОПЕРИОДА(ВыпускПродукцииБухгалтерскийУчет.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	|			НАЧАЛОПЕРИОДА(ВыпускПродукцииБухгалтерскийУчет.Период, ДЕКАДА) КАК ПериодДекада,
	|			НАЧАЛОПЕРИОДА(ВыпускПродукцииБухгалтерскийУчет.Период, МЕСЯЦ) КАК ПериодМесяц,
	|			НАЧАЛОПЕРИОДА(ВыпускПродукцииБухгалтерскийУчет.Период, КВАРТАЛ) КАК ПериодКвартал,
	|			НАЧАЛОПЕРИОДА(ВыпускПродукцииБухгалтерскийУчет.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	|			НАЧАЛОПЕРИОДА(ВыпускПродукцииБухгалтерскийУчет.Период, ГОД) КАК ПериодГод,
	|			ВыпускПродукцииБухгалтерскийУчет.Регистратор.* КАК Регистратор}) КАК ВложенныйЗапрос
	|
	|	СГРУППИРОВАТЬ ПО
	|		ВложенныйЗапрос.Организация,
	|		ВложенныйЗапрос.СчетУчета,
	|		ВложенныйЗапрос.Подразделение,
	|		ВложенныйЗапрос.НоменклатурнаяГруппа,
	|		ВложенныйЗапрос.Продукция,
	|		ВложенныйЗапрос.ХарактеристикаПродукции,
	|		ВложенныйЗапрос.СерияПродукции,
	|		ВложенныйЗапрос.Спецификация,
	|		ВложенныйЗапрос.Заказ,
	|		ВложенныйЗапрос.ДокументВыпуска,
	|		ВложенныйЗапрос.СтатьяЗатрат,
	|		ВложенныйЗапрос.Затрата,
	|		ВложенныйЗапрос.ХарактеристикаЗатраты,
	|		ВложенныйЗапрос.СерияЗатраты,
	|		ВложенныйЗапрос.КодОперации,
	|		ВложенныйЗапрос.Период,
	|		ВложенныйЗапрос.ПериодДень,
	|		ВложенныйЗапрос.ПериодНеделя,
	|		ВложенныйЗапрос.ПериодДекада,
	|		ВложенныйЗапрос.ПериодМесяц,
	|		ВложенныйЗапрос.ПериодКвартал,
	|		ВложенныйЗапрос.ПериодПолугодие,
	|		ВложенныйЗапрос.ПериодГод,
	|		ВложенныйЗапрос.Регистратор,
    |		ВложенныйЗапрос.НалоговоеНазначение) КАК ВложенныйЗапрос
	|	//СОЕДИНЕНИЯ
	|{ГДЕ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.ПериодДень КАК ПериодДень,
	|	ВложенныйЗапрос.ПериодНеделя КАК ПериодНеделя,
	|	ВложенныйЗапрос.ПериодДекада КАК ПериодДекада,
	|	ВложенныйЗапрос.ПериодМесяц КАК ПериодМесяц,
	|	ВложенныйЗапрос.ПериодКвартал КАК ПериодКвартал,
	|	ВложенныйЗапрос.ПериодПолугодие КАК ПериодПолугодие,
	|	ВложенныйЗапрос.ПериодГод КАК ПериодГод,
	|	ВложенныйЗапрос.Регистратор КАК Регистратор,
	|	ВложенныйЗапрос.Количество КАК Количество,
	|	ВложенныйЗапрос.Стоимость КАК Стоимость,
	|	ВложенныйЗапрос.КоличествоВыпуск КАК КоличествоВыпуск,
	|	ВложенныйЗапрос.СтоимостьВыпуск КАК СтоимостьВыпуск,
	|	ВложенныйЗапрос.СтоимостьНУ КАК СтоимостьНУ,
	|	ВложенныйЗапрос.СтоимостьВыпускНУ КАК СтоимостьВыпускНУ,
	|	ВложенныйЗапрос.НДСВходящий,
    |	ВложенныйЗапрос.НДСКредит,
    |	ВложенныйЗапрос.НДСВходящийВыпуск,
    |	ВложенныйЗапрос.НДСКредитВыпуск
	|	//УСЛОВИЯ_СВОЙСТВА
	|	//УСЛОВИЯ_КАТЕГОРИИ
	|}
	|{УПОРЯДОЧИТЬ ПО
	|	Организация.*,
	|	СчетУчета.*,
	|	Подразделение.*,
	|	НоменклатурнаяГруппа.*,
	|	Продукция.*,
	|	ХарактеристикаПродукции.*,
	|	СерияПродукции.*,
	|	Спецификация.*,
	|	Заказ.*,
	|	ДокументВыпуска.*,
	|	СтатьяЗатрат.*,
	|	Затрата.*,
	|	ХарактеристикаЗатраты.*,
	|	СерияЗатраты.*,
	|	КодОперации.*,
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	Регистратор.*,
	|	Количество,
	|	Стоимость,
	|	КоличествоВыпуск,
	|	СтоимостьВыпуск,
	|	СтоимостьНУ,
	|	СтоимостьВыпускНУ,
	|	НДСВходящий,
    |	НДСКредит,
    |	НДСВходящийВыпуск,
    |	НДСКредитВыпуск,
    |	НалоговоеНазначение.*
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Стоимость),
	|	СУММА(КоличествоВыпуск),
	|	СУММА(СтоимостьВыпуск),
	|	СУММА(СтоимостьНУ),
	|	СУММА(СтоимостьВыпускНУ),
	|	СУММА(НДСВходящий),
    |	СУММА(НДСКредит),
    |	СУММА(НДСВходящийВыпуск),
    |	СУММА(НДСКредитВыпуск)
	|	//ИТОГИ_СВОЙСТВА
	|	//ИТОГИ_КАТЕГОРИИ
	|ПО
	|	ОБЩИЕ
	|{ИТОГИ ПО
	|	Организация.*,
	|	СчетУчета.*,
	|	Подразделение.*,
	|	НоменклатурнаяГруппа.*,
	|	Продукция.*,
	|	ХарактеристикаПродукции.*,
	|	СерияПродукции.*,
	|	Спецификация.*,
	|	Заказ.*,
	|	ДокументВыпуска.*,
	|	СтатьяЗатрат.*,
	|	Затрата.*,
	|	ХарактеристикаЗатраты.*,
	|	СерияЗатраты.*,
	|	КодОперации.*,
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	Регистратор.*,
	|	НалоговоеНазначение.*
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}";
	
	// В универсальном отчете включен флаг использования свойств и категорий.
	Если УниверсальныйОтчет.ИспользоватьСвойстваИКатегории Тогда
		
		// Добавление свойств и категорий поля запроса в таблицу полей.
		// Необходимо вызывать для каждого поля запроса, предоставляющего возможность использования свойств и категорий.
		
		// УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля(<ПсевдонимТаблицы>.<Поле> , <ПсевдонимПоля>, <Представление>, <Назначение>);
        УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("Организация", "Организация", "Организация", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Организации);
        УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("НоменклатурнаяГруппа", "НоменклатурнаяГруппа", "Номенклатурная группа", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_НоменклатурныеГруппы);
        УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("Продукция", "Продукция", "Продукция", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура);
        УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ХарактеристикаПродукции", "ХарактеристикаПродукции", "Характеристика продукции", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ХарактеристикиНоменклатуры);
        УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("Затрата", "Затрата", "Затрата", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура);
        УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ХарактеристикаЗатраты", "ХарактеристикаЗатраты", "Характеристика затраты", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ХарактеристикиНоменклатуры);
		
		// Добавление свойств и категорий в исходный текст запроса.
		УниверсальныйОтчет.ДобавитьВТекстЗапросаСвойстваИКатегории(ТекстЗапроса);
		
	КонецЕсли;
		
	// Инициализация текста запроса построителя отчета
	УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;
	
	// Представления полей отчета.
	// Необходимо вызывать для каждого поля запроса.
	// УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить(<ИмяПоля>, <ПредставлениеПоля>);
	
	// Представления предопределенных полей запроса.
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Организация", "Организация");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СчетУчета", "Счет учета");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Подразделение", "Подразделение");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НоменклатурнаяГруппа", "Номенклатурная группа");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Продукция", "Продукция");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ХарактеристикаПродукции", "Характеристика продукции");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СерияПродукции", "Серия продукции");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Спецификация", "Спецификация");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Заказ", "Заказ");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ДокументВыпуска", "Документ выпуска");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтатьяЗатрат", "Статья затрат");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Затрата", "Затрата");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ХарактеристикаЗатраты", "Характеристика затраты");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СерияЗатраты", "Серия затраты");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КодОперации", "Код операции");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Количество", "Количество (затраты)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Стоимость", "Стоимость (затраты)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоВыпуск", "Количество (выпуск)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтоимостьВыпуск", "Стоимость (выпуск)");
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтоимостьНУ", "Стоимость НУ (затраты)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтоимостьВыпускНУ", "Стоимость НУ (выпуск)");
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НалоговоеНазначение", "Налоговое назначение");
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НДСВходящий", "НДС входящий (затраты)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НДСКредит", "НДС кредит (затраты)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НДСВходящийВыпуск", "НДС входящий (выпуск)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НДСКредитВыпуск", "НДС кредит (выпуск)");


	
	// Добавление показателей
	// Необходимо вызывать для каждого добавляемого показателя.
	// УниверсальныйОтчет.ДобавитьПоказатель(<ИмяПоказателя>, <ПредставлениеПоказателя>, <ВключенПоУмолчанию>, <Формат>, <ИмяГруппы>, <ПредставлениеГруппы>);
	УниверсальныйОтчет.ДобавитьПоказатель("Количество", "Количество", Истина, "ЧЦ=15; ЧДЦ=3", "Затраты", "Затраты");
	УниверсальныйОтчет.ДобавитьПоказатель("Стоимость", "Стоимость", Истина, "ЧЦ=15; ЧДЦ=2""Затраты", "Затраты");
	УниверсальныйОтчет.ДобавитьПоказатель("СтоимостьНУ", "Стоимость (НУ)", Истина, "ЧЦ=15; ЧДЦ=2","Затраты", "Затраты");
	УниверсальныйОтчет.ДобавитьПоказатель("НДСВходящий", "НДС входящий", Истина, "ЧЦ=15; ЧДЦ=2", "Затраты", "Затраты");
	УниверсальныйОтчет.ДобавитьПоказатель("НДСКредит", "НДС кредит", Истина, "ЧЦ=15; ЧДЦ=3", "Затраты", "Затраты");

	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоВыпуск", "Количество", Истина, "ЧЦ=15; ЧДЦ=3", "Выпуск", "Выпуск");
	УниверсальныйОтчет.ДобавитьПоказатель("СтоимостьВыпуск", "Стоимость", Истина, "ЧЦ=15; ЧДЦ=2", "Выпуск", "Выпуск");
	УниверсальныйОтчет.ДобавитьПоказатель("СтоимостьВыпускНУ", "Стоимость (НУ)", Истина, "ЧЦ=15; ЧДЦ=2", "Выпуск", "Выпуск");
	УниверсальныйОтчет.ДобавитьПоказатель("НДСВходящийВыпуск", "НДС входящий", Истина, "ЧЦ=15; ЧДЦ=2", "Выпуск", "Выпуск");
	УниверсальныйОтчет.ДобавитьПоказатель("НДСКредитВыпуск", "НДС кредит", Истина, "ЧЦ=15; ЧДЦ=3", "Выпуск", "Выпуск");


	// Добавление предопредедленных группировок строк отчета.
	// Необходимо вызывать для каждой добавляемой группировки строки.
	// УниверсальныйОтчет.ДобавитьИзмерениеСтроки(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Организация");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Подразделение");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Продукция");
	
	// Добавление предопредедленных группировок колонок отчета.
	// Необходимо вызывать для каждой добавляемой группировки колонки.
	// УниверсальныйОтчет.ДобавитьИзмерениеКолонки(<ПутьКДанным>);
	
	// Добавление предопредедленных отборов отчета.
	// Необходимо вызывать для каждого добавляемого отбора.
	// УниверсальныйОтчет.ДобавитьОтбор(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьОтбор("Организация");
	УниверсальныйОтчет.ДобавитьОтбор("Подразделение");
	УниверсальныйОтчет.ДобавитьОтбор("Продукция");
	УниверсальныйОтчет.ДобавитьОтбор("СтатьяЗатрат");
	УниверсальныйОтчет.ДобавитьОтбор("Затрата");
	
	// Установка связи подчиненных и родительских полей
	// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДаннымРодитель>);
	
	// Установка представлений полей
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	// Установка типов значений свойств в отборах отчета
	УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	// УниверсальныйОтчет.ДобавитьДополнительноеПоле(<ПутьКДанным>);
	
КонецПроцедуры // УстановитьНачальныеНастройкиБух()

// Процедура установки начальных настроек отчета с использованием текста запроса
//
Процедура УстановитьНачальныеНастройки(ДополнительныеПараметры = Неопределено) Экспорт
	
	УправлениеОтчетами.ВосстановитьРеквизитыОтчета(ЭтотОбъект, ДополнительныеПараметры);
	
	// Настройка общих параметров универсального отчета
	
	// Содержит название отчета, которое будет выводиться в шапке.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.мНазваниеОтчета = "Название отчета";
	УниверсальныйОтчет.мНазваниеОтчета = СокрЛП(ЭтотОбъект.Метаданные().Синоним) + " "
		+ ?(ВидУчета = 1, "(бухгалтерский учет)",
		  ?(ВидУчета = 2, "(налоговый учет)", "(управленческий учет)"));
	
	// Содердит признак необходимости отображения надписи и поля выбора раздела учета в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИмяРегистра = Истина;
	УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	
	// Содержит имя регистра, по метаданным которого будет выполняться заполнение настроек отчета.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.ИмяРегистра = "ТоварыНаСкладах";
	УниверсальныйОтчет.ИмяРегистра = "";
	
	// Содержит признак необходимости вывода отрицательных значений показателей красным цветом.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ОтрицательноеКрасным = Истина;
	УниверсальныйОтчет.ОтрицательноеКрасным = Истина;
	
	// Содержит признак необходимости вывода в отчет общих итогов.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ВыводитьОбщиеИтоги = Ложь;
	
	// Содержит признак необходимости вывода детальных записей в отчет.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ВыводитьДетальныеЗаписи = Истина;
	УниверсальныйОтчет.ВыводитьДетальныеЗаписи = Ложь;
	
	// Содержит признак необходимости отображения флага использования свойств и категорий в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Ложь;
	УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Истина;
	
	// Содержит признак использования свойств и категорий при заполнении настроек отчета.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.ИспользоватьСвойстваИКатегории = Истина;
	//УниверсальныйОтчет.ИспользоватьСвойстваИКатегории = Ложь;
	
	// Содержит признак использования простой формы настроек отчета без группировок колонок.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.мРежимФормыНастройкиБезГруппировокКолонок = Истина;
	УниверсальныйОтчет.мРежимФормыНастройкиБезГруппировокКолонок = Ложь;
	
	Если      ВидУчета = 1 Тогда // Бух.
		УстановитьНачальныеНастройкиБух(ДополнительныеПараметры);
	//ИначеЕсли ВидУчета = 2 Тогда // Нал.
	//	УстановитьНачальныеНастройкиНал(ДополнительныеПараметры);
	Иначе // Упр
		УстановитьНачальныеНастройкиУпр(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры // УстановитьНачальныеНастройки()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ОТЧЕТА 
	
// Процедура формирования отчета
//
Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	// Перед формирование отчета можно установить необходимые параметры универсального отчета.
	МассивКодовОперацийВыпуска = Новый Массив;
	МассивКодовОперацийВыпуска.Добавить(Перечисления.КодыОперацийВыпускПродукции.ВыпускПродукцииПоФиксированнойСтоимости);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("МассивКодовОперацийИсключение", МассивКодовОперацийВыпуска);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("СтатусыМатериальныхЗатратНаПроизводствоПринятыеВПереработку", Перечисления.СтатусыМатериальныхЗатратНаПроизводство.ПринятыеВПереработку);
	
	УниверсальныйОтчет.СформироватьОтчет(ТабличныйДокумент,,, ЭтотОбъект);

КонецПроцедуры // СформироватьОтчет()

Функция ПолучитьТекстСправкиФормы() Экспорт
	
	ТекстСправкиФормы = "";
	
	Если глЗначениеПеременной("ИспользоватьРасширеннуюАналитикуУчетаНоменклатурыИЗатрат") Тогда
		НачалоИспользования = Формат(глЗначениеПеременной("ДатаНачалаИспользованияРасширеннойАналитикиУчетаНоменклатурыИЗатрат"), "ДФ=dd.MM.yyyy");
		
		ТекстСправкиФормы = "<P>С " + НачалоИспользования + " установлено использование расширенной аналитики учета затрат."
					+ "<BR><b>Использование отчета для расширенной аналитики не поддерживается<b>.<P>";
	КонецЕсли; 
	
	Возврат ТекстСправкиФормы;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура обработки расшифровки
//
Процедура ОбработкаРасшифровки(Расшифровка, Объект) Экспорт
	
	// Дополнительные параметры в расшифровывающий отчет можно передать
	// посредством инициализации переменной "ДополнительныеПараметры".
	
	ДополнительныеПараметры = УправлениеОтчетами.СохранитьРеквизитыОтчета(ЭтотОбъект);
	УниверсальныйОтчет.ОбработкаРасшифровкиУниверсальногоОтчета(Расшифровка, Объект, ДополнительныеПараметры);
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру для сохранения настроек отчета
//
Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	
	УниверсальныйОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками);
	УправлениеОтчетами.СохранитьРеквизитыОтчета(ЭтотОбъект, СтруктураСНастройками);
	
КонецПроцедуры // СформироватьСтруктуруДляСохраненияНастроек()

// Заполняет настройки отчета из структуры сохраненных настроек
//
Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	УправлениеОтчетами.ВосстановитьРеквизитыОтчета(ЭтотОбъект, СтруктураСНастройками);
	Возврат УниверсальныйОтчет.ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ЭтотОбъект);
	
КонецФункции // ВосстановитьНастройкиИзСтруктуры()

// Содержит значение используемого режима ввода периода.
// Тип: Число.
// Возможные значения: 0 - произвольный период, 1 - на дату, 2 - неделя, 3 - декада, 4 - месяц, 5 - квартал, 6 - полугодие, 7 - год
// Значение по умолчанию: 0
// Пример:
// УниверсальныйОтчет.мРежимВводаПериода = 1;

#КонецЕсли
